#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОборудованиеОрганизации
	Движения.ОборудованиеОрганизации.Записывать = Истина;
	Движения.ОборудованиеОрганизации.Записать();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходнаяНакладнаяПереченьОборудования.Оборудование,
		|	ПриходнаяНакладнаяПереченьОборудования.СрокГодности,
		|	СУММА(ПриходнаяНакладнаяПереченьОборудования.Количество) КАК Количество,
		|	СУММА(ПриходнаяНакладнаяПереченьОборудования.Цена) КАК Цена,
		|	СУММА(ПриходнаяНакладнаяПереченьОборудования.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ПриходнаяНакладная.ПереченьОборудования КАК ПриходнаяНакладнаяПереченьОборудования
		|ГДЕ
		|	ПриходнаяНакладнаяПереченьОборудования.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ПриходнаяНакладнаяПереченьОборудования.Оборудование,
		|	ПриходнаяНакладнаяПереченьОборудования.СрокГодности";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	СостояниеНаСкладе = Перечисления.СостояниеОборудования.НаСкладе;
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОборудованиеОрганизации.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Оборудование = Выборка.Оборудование;
		Движение.СостояниеОборудования = СостояниеНаСкладе;
		Движение.ГоденДо = ДобавитьМесяц(Дата, Выборка.СрокГодности);
		Движение.Количество = Выборка.Количество;
		Движение.Сумма = Выборка.Сумма;
	КонецЦикла;	
	
КонецПроцедуры
#КонецОбласти
#КонецЕсли
