#Область СлужебныеПроцедурыИФункции

Процедура ФормированиеВыбытияОборудования() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВыбытиеОборудовантя.Ссылка
	|ИЗ
	|	Документ.ВыбытиеОборудовантя КАК ВыбытиеОборудовантя
	|ГДЕ
	|	ВыбытиеОборудовантя.Дата = &Дата
	|	И ВыбытиеОборудовантя.Проведен";

	Запрос.УстановитьПараметр("Дата", НачалоМесяца(ТекущаяДатаСеанса()));

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Документ = Документы.ВыбытиеОборудовантя.СоздатьДокумент();
	Документ.Записать(РежимЗаписиДокумента.Проведение);

КонецПроцедуры
#КонецОбласти