#Область СлужебныеПроцедурыИФункции

Процедура РасчетСуммы(ТекДанные) Экспорт 	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена; 	
КонецПроцедуры

Процедура РасчетЦены(ТекДанные) Экспорт  	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.Цена = ТекДанные.Сумма / ТекДанные.Количество; 	
КонецПроцедуры

Процедура НоменклатураПриИзменении(ТекДанные) Экспорт
	ТекДанные.Количество = 1;
	ТекДанные.Цена = 0;	
КонецПроцедуры

#КонецОбласти
